docs/content/docs/console/commands.md
---
title: "Commands"
author: ["Petros Papapanagiotou"]
lastmod: 2021-06-14T23:26:05+01:00
draft: false
weight: 320
---

This section covers the main process specification and composition commands.

It is worth noting that the result of these commands is of type `Composer.Response`, which is [defined as follows](https://github.com/workflowfm/workflowfm-reasoner/blob/master/src/api/composer.ml):

```ocaml
module Response :
  sig
    type t =
      | Ping of float
      | Create of Process.t
      | Compose of Process.t * Action.t * Actionstate.t
      | Verify of Process.t
      | Deploy of string * (string * string * bool) list
      | Failed of string
      | Exception of string
    (*...*)
  end
```

Upon failure a `Failed` or an `Exception` response will be issued with an associated message describing the failure. Otherwise, one of the other responses will be returned, as explained in the normal operation of each command below.


## create {#create}

The `create` command constructs a new atomic process given the types of its desired inputs and output.

It takes 3 arguments:

1.  `string`: The name of the process.
2.  `term list`: The list of types of its inputs.
3.  `term`: The type of its output.

All terms are expected to be [resources](../../elements/resources/) involving HOL Light propositions and the operators `++` and `**` operators. No negative operators (`NEG`, `&`, `%`) should be used, including in the input types.

The command returns a `Create` response with the specification of the created process.


#### Notes {#notes}

-   Terms in HOL Light must be surrounded by back-ticks `` ` ``.
-   If a process with the same name already exists, a warning will be shown and the old process will be replaced.
-   All the elements of the process other than its name and its types, including channel names, &pi;-calculus specification, and provenance are constructed automatically.


#### Example {#example}

The following invocation of `create` constructs a process named `"P"` with two inputs of types `X` and `Y++Z` respectively and an output of type `A**B**C`:

```ocaml
create "P" [`X`; `Y ++ Z`] `A ** B ** C`;;
```

```ocaml
Console.Composer.Response.Create
   {Console.Composer.Process.name = "P";
    inputs = [(`X`, `cP_X_1`); (`Y ++ Z`, `cP_lB_Y_Plus_Z_rB_2`)];
    output = (`A ** B ** C`, `oP_lB_A_x_lB_B_x_C_rB_rB_`);
    prov =
     Provnode ("times", Provleaf "P",
      Provnode ("times", Provleaf "P", Provleaf "P"));
    proc =
     `P (cP_X_1,cP_lB_Y_Plus_Z_rB_2,oP_lB_A_x_lB_B_x_C_rB_rB_) =
      Comp (In cP_X_1 [cP_X_1__a_X] Zero)
      (Comp
       (Res [cP_lB_Y_Plus_Z_rB_2__opt_Y; cP_lB_Y_Plus_Z_rB_2__opt_Z]
       (Out cP_lB_Y_Plus_Z_rB_2
        [cP_lB_Y_Plus_Z_rB_2__opt_Y; cP_lB_Y_Plus_Z_rB_2__opt_Z]
       (Plus
        (In cP_lB_Y_Plus_Z_rB_2__opt_Y [cP_lB_Y_Plus_Z_rB_2_Y]
        (In cP_lB_Y_Plus_Z_rB_2_Y [cP_lB_Y_Plus_Z_rB_2_l_a_Y] Zero))
       (In cP_lB_Y_Plus_Z_rB_2__opt_Z [cP_lB_Y_Plus_Z_rB_2_Z]
       (In cP_lB_Y_Plus_Z_rB_2_Z [cP_lB_Y_Plus_Z_rB_2_r_a_Z] Zero)))))
      (Res
       [oP_lB_A_x_lB_B_x_C_rB_rB__A; oP_lB_A_x_lB_B_x_C_rB_rB__lB_B_x_C_rB]
      (Out oP_lB_A_x_lB_B_x_C_rB_rB_
       [oP_lB_A_x_lB_B_x_C_rB_rB__A; oP_lB_A_x_lB_B_x_C_rB_rB__lB_B_x_C_rB]
      (Comp
       (Res [oP_lB_A_x_lB_B_x_C_rB_rB__l_a_A]
       (Out oP_lB_A_x_lB_B_x_C_rB_rB__A [oP_lB_A_x_lB_B_x_C_rB_rB__l_a_A]
       Zero))
      (Res [oP_lB_A_x_lB_B_x_C_rB_rB__rB; oP_lB_A_x_lB_B_x_C_rB_rB__rC]
      (Out oP_lB_A_x_lB_B_x_C_rB_rB__lB_B_x_C_rB
       [oP_lB_A_x_lB_B_x_C_rB_rB__rB; oP_lB_A_x_lB_B_x_C_rB_rB__rC]
      (Comp
       (Res [oP_lB_A_x_lB_B_x_C_rB_rB__rl_a_B]
       (Out oP_lB_A_x_lB_B_x_C_rB_rB__rB [oP_lB_A_x_lB_B_x_C_rB_rB__rl_a_B]
       Zero))
      (Res [oP_lB_A_x_lB_B_x_C_rB_rB__rr_a_C]
      (Out oP_lB_A_x_lB_B_x_C_rB_rB__rC [oP_lB_A_x_lB_B_x_C_rB_rB__rr_a_C]
      Zero)))))))))`;
    actions = []; copier = false; intermediate = false}
```


## tensor {#tensor}

The `tensor` command composes two processes in parallel with the [`TENSOR` action](../../elements/composition/#tensor).

It takes 2 arguments:

1.  `string`: The name of the first process to compose.
2.  `string`: The name of the second process to compose.

The command returns a `Compose` response with the specification of the created intermediate composition, the composition action that was applied, and the [resulting actionstate](../../elements/composition/#actionstate) with additional metadata.


#### Notes {#notes}

-   The name of the resulting intermediate composition is automatically determined using the `"_Step"` prefix and an internal [step counter]({{< relref "state#step" >}}).


#### Example {#example}

The following invocation of `tensor` performs the parallel composition `_Step0` of a process `P` with input `X` and output `A ++ B` and a process `Q` with inputs `Y` and `Z` and output `C`:

```ocaml
create "P" [`X`] `A ++ B` ;;
create "Q" [`Y`; `Z`] `C` ;;
tensor "P" "Q" ;;
```

```ocaml
Console.Composer.Response.Compose
 ({Console.Composer.Process.name = "_Step0";
   inputs = [(`X`, `cP_X_1`); (`Y`, `cQ_Y_1`); (`Z`, `cQ_Z_2`)];
   output = (`(A ++ B) ** C`, `c_Step0___Step0__z1`);
   prov =
    Provnode ("times", Provnode ("plus", Provleaf "P", Provleaf "P"),
     Provleaf "Q");
   proc =
    `_Step0 (cP_X_1,cQ_Y_1,cQ_Z_2,c_Step0___Step0__z1) =
     PiTimesProc (A ++ B) C c_Step0___Step0__z1 oP_lB_A_Plus_B_rB_ oQ_C_
     (P (cP_X_1,oP_lB_A_Plus_B_rB_))
     (Q (cQ_Y_1,cQ_Z_2,oQ_C_))`;
   actions =
    [{Action.act = "TENSOR"; larg = "P"; lsel = ""; rarg = "Q"; rsel = "";
      res = "_Step0"}];
   copier = false; intermediate = true},
 {Action.act = "TENSOR"; larg = "P"; lsel = ""; rarg = "Q"; rsel = "";
  res = "_Step0"},
 {Actionstate.label = "_Step0"; ctr = 0;
  metas =
   [`c_Step0___Step0__z1`; `c_Step0___Step0__y1`; `c_Step0___Step0__Q1`;
    `cQ_Y_1`; `cQ_Z_2`; `oQ_C_`; `cP_X_1`; `oP_lB_A_Plus_B_rB_`];
  merged = []; iprov = [];
  prov =
   [("_Step0",
     Provnode ("times", Provnode ("plus", Provleaf "P", Provleaf "P"),
      Provleaf "Q"));
    ("P", Provnode ("plus", Provleaf "P", Provleaf "P"));
    ("Q", Provleaf "Q")]})
```


## cwith {#with}

The `cwith` command composes two processes conditionally with the [`WITH` action](../../elements/composition/#with).

It takes 4 arguments:

1.  `string`: The name of the first process to compose.
2.  `string`: The type of the input to use from the first process.
3.  `string`: The name of the second process to compose.
4.  `string`: The type of the input to use from the second process.

The command returns a `Compose` response with the specification of the created intermediate composition, the composition action that was applied, and the [resulting actionstate](../../elements/composition/#actionstate) with additional metadata.


#### Notes {#notes}

-   The name of the resulting intermediate composition is automatically determined using the `"_Step"` prefix and an internal [step counter]({{< relref "state#step" >}}).
-   The types of the selected inputs need to be provided as **strings** and not as terms.
