docs/org/console.org
**** Example

     The following invocation of ~cwith~ performs the conditional composition ~_Step0~ of a process ~P~ with input ~X~ and output ~A ++ B~ and a process ~Q~ with inputs ~Y~ and ~Z~ and output ~C~ with inputs ~X~ and ~Y~ selected:

#+BEGIN_SRC ocaml 
  create "P" [`X`] `A ++ B` ;;
  create "Q" [`Y`; `Z`] `C` ;;
  cwith "P" "X" "Q" "Y" ;;
#+END_SRC

#+RESULTS:
#+begin_SRC ocaml
  Console.Composer.Response.Compose
   ({Console.Composer.Process.name = "_Step0";
     inputs = [(`Z`, `cQ_Z_2`); (`X ++ Y`, `c_Step0___Step0__x3`)];
     output = (`((A ++ B) ** Z) ++ C`, `c_Step0___Step0__y3`);
     prov =
      Provnode ("plus",
       Provnode ("times",
        Provnode ("plus", Provleaf "&_Step0", Provleaf "&_Step0"),
        Provleaf "&_Step0"),
       Provleaf "&_Step0");
     proc =
      `_Step0 (cQ_Z_2,c_Step0___Step0__x3,c_Step0___Step0__y3) =
       PiWithProc (NEG X) (NEG Y) c_Step0___Step0__x3 cP_X_1 cQ_Y_1
       c_Step0___Step0__uI3
       c_Step0___Step0__vI3
       (PiPlusLProc ((A ++ B) ** Z) C c_Step0___Step0__y3 c_Step0___Step0__z1
        c_Step0___Step0__uR3
        c_Step0___Step0__vR3
       (PiTimesProc (A ++ B) Z c_Step0___Step0__z1 oP_lB_A_Plus_B_rB_
        c_Step0___Step0__y1
        (P (cP_X_1,oP_lB_A_Plus_B_rB_))
       (PiIdProc Z cQ_Z_2 c_Step0___Step0__y1 c_Step0___Step0__m2)))
       (PiPlusRProc ((A ++ B) ** Z) C c_Step0___Step0__y3 oQ_C_
        c_Step0___Step0__uE3
        c_Step0___Step0__vE3
       (Q (cQ_Y_1,cQ_Z_2,oQ_C_)))`;
     actions =
      [{Action.act = "WITH"; larg = "P"; lsel = "X"; rarg = "Q"; rsel = "Y";
        res = "_Step0"}];
     copier = false; intermediate = true},
   {Action.act = "WITH"; larg = "P"; lsel = "X"; rarg = "Q"; rsel = "Y";
    res = "_Step0"},
   {Actionstate.label = "_Step0"; ctr = 0;
    metas =
     [`c_Step0___Step0__x3`; `c_Step0___Step0__uI3`; `c_Step0___Step0__vI3`;
      `c_Step0___Step0__uR3`; `c_Step0___Step0__vR3`; `c_Step0___Step0__y3`;
      `c_Step0___Step0__d3`; `c_Step0___Step0__uE3`; `c_Step0___Step0__vE3`;
      `c_Step0___Step0__Q3`; `c_Step0___Step0__m2`; `c_Step0___Step0__z1`;
      `c_Step0___Step0__y1`; `c_Step0___Step0__Q1`; `cQ_Y_1`; `cQ_Z_2`;
      `oQ_C_`; `cP_X_1`; `oP_lB_A_Plus_B_rB_`];
    merged = [(`NEG (X ++ Y) <> c_Step0___Step0__x3`, "cP_X_1", "cQ_Y_1")];
    iprov = [];
    prov =
     [("_Step0",
       Provnode ("plus",
        Provnode ("times",
         Provnode ("plus", Provleaf "&_Step0", Provleaf "&_Step0"),
         Provleaf "&_Step0"),
        Provleaf "&_Step0"));
      ("P", Provnode ("plus", Provleaf "P", Provleaf "P"));
      ("Q", Provleaf "Q")]})
#+end_SRC
** join
   :PROPERTIES:
   :CUSTOM_ID: join
   :END:
   
   The ~join~ command composes two processes in sequence with the [[../../elements/composition/#join][~JOIN~ action]].

   It takes 4 arguments:
   1. ~string~: The name of the first process to compose.
   2. ~string~: The path to a sub-term of the output of the first process.
   3. ~string~: The name of the second process to compose.
   4. ~string~: The type of the input to use from the second process.
   
   The command returns a ~Compose~ response with the specification of the created intermediate composition, the composition action that was applied, and the [[../../elements/composition/#actionstate][resulting actionstate]] with additional metadata.

**** Notes

   - The name of the resulting intermediate composition is automatically determined using the ~"_Step"~ prefix and an internal [[#step][step counter]].
   - The path to a sub-type of the output of the first process must follow the syntax of [[https://www.cl.cam.ac.uk/~jrh13/hol-light/HTML/find_path.html][HOL Light's ~find_path~ function]]. 
   - The types of the selected input need to be provided as a *string* and not as a term.

**** Reset :noexport:

     #+BEGIN_SRC ocaml :export no :results silent
     full_reset();;
     #+END_SRC

**** Example

     The following invocation of ~join~ performs the sequential composition ~_Step0~ of a process ~P~ with input ~X~ and output ~A ++ B~ and a process ~Q~ with inputs ~A~ and ~Y~ and output ~C~:

#+BEGIN_SRC ocaml 
  create "P" [`X`] `A ++ B` ;;
  create "Q" [`A`; `Z`] `C` ;;
  join "P" "lr" "Q" "A" ;;
#+END_SRC

#+RESULTS:
#+begin_SRC ocaml
  Console.Composer.Response.Compose
   ({Console.Composer.Process.name = "_Step0";
     inputs = [(`X`, `cP_X_1`); (`Z`, `cQ_Z_2`)];
     output = (`C ++ (Z ** B)`, `c_Step0___Step0__y3`);
     prov =
      Provnode ("plus", Provleaf "Q",
       Provnode ("times", Provleaf "Q:cQ_Z_2", Provleaf "P"));
     proc =
      `_Step0 (cP_X_1,cQ_Z_2,c_Step0___Step0__y3) =
       PiCutProc (A ++ B) c_Step0___Step0__z7 c_Step0___Step0__x3
       oP_lB_A_Plus_B_rB_
       (PiWithProc (NEG A) (NEG B) c_Step0___Step0__x3 cQ_A_1
        c_Step0___Step0__c3
        c_Step0___Step0__uI3
        c_Step0___Step0__vI3
        (PiPlusLProc C (Z ** B) c_Step0___Step0__y3 oQ_C_
         c_Step0___Step0__uR3
         c_Step0___Step0__vR3
        (Q (cQ_A_1,cQ_Z_2,oQ_C_)))
       (PiPlusRProc C (Z ** B) c_Step0___Step0__y3 c_Step0___Step0__d3
        c_Step0___Step0__uE3
        c_Step0___Step0__vE3
       (PiTimesProc Z B c_Step0___Step0__d3 c_Step0___Step0__x4
        c_Step0___Step0__y4
        (PiIdProc Z cQ_Z_2 c_Step0___Step0__x4 c_Step0___Step0__m5)
       (PiIdProc B c_Step0___Step0__c3 c_Step0___Step0__y4
       c_Step0___Step0__m6))))
       (P (cP_X_1,oP_lB_A_Plus_B_rB_))`;
     actions =
      [{Action.act = "JOIN"; larg = "P"; lsel = "lr"; rarg = "Q"; rsel = "A";
        res = "_Step0"}];
     copier = false; intermediate = true},
   {Action.act = "JOIN"; larg = "P"; lsel = "lr"; rarg = "Q"; rsel = "A";
    res = "_Step0"},
   {Actionstate.label = "_Step0"; ctr = 0;
    metas =
     [`c_Step0___Step0__z7`; `c_Step0___Step0__y7`; `c_Step0___Step0__Q7`;
      `c_Step0___Step0__m6`; `c_Step0___Step0__m5`; `c_Step0___Step0__x4`;
      `c_Step0___Step0__y4`; `c_Step0___Step0__P4`; `c_Step0___Step0__Q4`;
      `c_Step0___Step0__x3`; `c_Step0___Step0__c3`; `c_Step0___Step0__uI3`;
      `c_Step0___Step0__vI3`; `c_Step0___Step0__uR3`; `c_Step0___Step0__vR3`;
      `c_Step0___Step0__y3`; `c_Step0___Step0__d3`; `c_Step0___Step0__uE3`;
      `c_Step0___Step0__vE3`; `c_Step0___Step0__Q3`; `cQ_A_1`; `cQ_Z_2`;
      `oQ_C_`; `cP_X_1`; `oP_lB_A_Plus_B_rB_`];
    merged = [];
    iprov =
     [(`A ++ B`, Provnode ("plus", Provleaf "cQ_A_1:1", Provleaf "#"))];
    prov =
     [("Q", Provleaf "Q");
      ("_Step0",
       Provnode ("plus", Provleaf "Q",
        Provnode ("times", Provleaf "Q:cQ_Z_2", Provleaf "P")));
      ("P", Provnode ("plus", Provleaf "P", Provleaf "P"))]})
#+end_SRC
** compose1
   :PROPERTIES:
   :CUSTOM_ID: compose1
   :END:

   The ~compose1~ command composes two processes with an explicit [[../../elements/composition/#actions][composition action]].

   It takes 1 argument:
   1. ~Action.t~: The composition action to perform.

   This command is intended for advanced usage, for instance with a custom action, or some other action parameter not handled by the other commands.
   
   The command returns a ~Compose~ response with the specification of the created intermediate composition, the composition action that was applied, and the [[../../elements/composition/#actionstate][resulting actionstate]] with additional metadata.

**** Notes

   - If an intermediate composition with the same name as the action's result already exists, a warning will be shown and the old process will be replaced.

**** Reset :noexport:

     #+BEGIN_SRC ocaml :export no :results silent
     full_reset();;
     #+END_SRC

