docs/org/console.org
**** Example

     The following invocation of ~compose1~ performs the parallel composition ~R~ of a process ~P~ with input ~X~ and output ~A ++ B~ and a process ~Q~ with inputs ~Y~ and ~Z~ and output ~C~:

#+BEGIN_SRC ocaml 
  create "P" [`X`] `A ++ B` ;;
  create "Q" [`Y`; `Z`] `C` ;;
  compose1 {Action.act = "TENSOR"; larg = "P"; lsel = ""; rarg = "Q"; rsel = ""; res = "R"} ;;
#+END_SRC

#+RESULTS:
#+begin_SRC ocaml
  Console.Composer.Response.Compose
   ({Console.Composer.Process.name = "R";
     inputs = [(`X`, `cP_X_1`); (`Y`, `cQ_Y_1`); (`Z`, `cQ_Z_2`)];
     output = (`(A ++ B) ** C`, `cR__R__z1`);
     prov =
      Provnode ("times", Provnode ("plus", Provleaf "P", Provleaf "P"),
       Provleaf "Q");
     proc =
      `R (cP_X_1,cQ_Y_1,cQ_Z_2,cR__R__z1) =
       PiTimesProc (A ++ B) C cR__R__z1 oP_lB_A_Plus_B_rB_ oQ_C_
       (P (cP_X_1,oP_lB_A_Plus_B_rB_))
       (Q (cQ_Y_1,cQ_Z_2,oQ_C_))`;
     actions =
      [{Action.act = "TENSOR"; larg = "P"; lsel = ""; rarg = "Q"; rsel = "";
        res = "R"}];
     copier = false; intermediate = true},
   {Action.act = "TENSOR"; larg = "P"; lsel = ""; rarg = "Q"; rsel = "";
    res = "R"},
   {Actionstate.label = "R"; ctr = 0;
    metas =
     [`cR__R__z1`; `cR__R__y1`; `cR__R__Q1`; `cQ_Y_1`; `cQ_Z_2`; `oQ_C_`;
      `cP_X_1`; `oP_lB_A_Plus_B_rB_`];
    merged = []; iprov = [];
    prov =
     [("R",
       Provnode ("times", Provnode ("plus", Provleaf "P", Provleaf "P"),
        Provleaf "Q"));
      ("P", Provnode ("plus", Provleaf "P", Provleaf "P"));
      ("Q", Provleaf "Q")]})
#+end_SRC
